package com.skinry.app.utils;

public class Const {
    public static final String JPEG_FILE_PREFIX = "IMG_";
    public static final String JPEG_FILE_SUFFIX = ".jpg";
    public static final String ALBUM_NAME = "Skinry";
    public final static String EXTRA_PATH_MESSAGE = "com.skinry.app.ui.PATH_MESSAGE";
    public final static String TMP_IMAGE_FILE_NAME = "some.jpg";
    public static final String API_SEND_URL = "http://5.9.107.99:5000/api/v1/";
    public static final String API_POST_PROC_URL = "http://5.9.107.99:5000/api/v1/proc/";
    public static final String BASE_FILE = "base.txt";
    public static final String ERROR_NO_FACE = "Error: No face. May be your eyes are closed";
    public static final String ERROR_SMALL_FACE = "Face is too small";
    public static final String FLURRY_API_KEY = "XYFPYHKBZZMCCRRHWGNK";

    public static final int THUMBNAIL_SIZE = 64;

    public static final String[] ADVICES = {
            "Метод. Смешай соду для выпечки с водой в пропорции 1:1. Нанеси пасту на" +
                    "отдельные прыщи при помощи ватной палочки. Держи маску 10 минут, затем " +
                    "смой холодной водой. Повторяй процедуру не более двух раз в день. При " +
                    "появлении раздражений, прекрати лечение",
            "Метод. Разрежь лимон пополам и протри прыщи открытой частью лимона. " +
                    "Ощущение покалывания означает, что средство работает. После смой лимонный " +
                    "сок. Чтобы защитить ослабленную лимонным соком кожу от повреждения " +
                    "солнечными лучами, используй солнцезащитный крем.",
            "Метод. Разрежь сырой картофель пополам и протри прыщи открытой частью " +
                    "картофеля. Сырой картофель обладает противовоспалительным действием. Затем " +
                    "смой остатки водой.",
            "Метод. Чтобы быстро избавиться от одного-единственного, но большого " +
                    "прыща, используй натуральную зубную пасту с диоксидом кремния (без " +
                    "лаурилсульфата натрия!). Диоксид кремния за ночь высушит и уменьшит прыщ в " +
                    "размере.",
            "Совет. Чтобы закрыть поры и уменьшить воспаление, мягко протри кожу " +
                    "кубиком льда в проблемной зоне. Лед сузит кровеносные сосуды под кожей, " +
                    "раздражение и воспаление станет менее заметным",
            "Метод. Для уменьшения воспаления и ликвидации небольших прыщей, " +
                    "используй масло чайного дерева. Оно является известным противогрибковым и " +
                    "атибактериальным травяным средством",
            "Метод. Раскроши одну-две таблетки аспирина и смешай ее с водой так, чтобы " +
                    "получилась паста. Ватной палочкой нанеси пасту на отдельные прыщи и оставь " +
                    "высыхать. Аспирин содержит салициловую кислоту, которая убивает бактерии, " +
                    "образовывающие прыщи.",
            "Метод. Купи калий квасцов в отделе специй продуктового магазина. " +
                    "Постарайся достать большой кусок вместо порошка. Аккуратно протри квасцами " +
                    "проблемные зоны. Квасцы являются природным антисептиком и сжимают " +
                    "кожную ткань.",
            "Питание. Сократи потребление рафинированных углеводов: хлеба, " +
                    "макаронных изделий. Уменьши потребление сахара - старайся употреблять " +
                    "только немного натурального сахара.",
            "Питание. Принимай ферментированные продукты: квашеная капуста, кефир, " +
                    "сыр из козьего молока, натуральный йогурт. Потребляй хорошоие пробиотики и " +
                    "ферменты",
            "Уход за кожей. Перестань использовать моющие средства, кремы для лица, косметики и тому подобное. Если все же хочешь использовать эти продукты, купи натуральные.",
            "Питание. Ешь больше овощей! Они очищают кровь от токсинов, которые вызывают раздражения кожи и ведут к образованию прыщей.",
            "Питание. Старайся пить как можно больше воды! Она вымывает токсины из организма и помогает очистить кожу. Пей минимум 2 литра воды в день.",
            "Совет. Веди более активный образ жизни, занимайся спортом. Например, прыжки на батуте - отличный способ разогреть твою лимфатическую систему. Бег и прыжки также полезны.",
            "Питание. Принимай поливитамины каждый день. Убедись, что в твоем рационе достаточное количество витамина А. Он поможет твоей коже быстрее восстанавливаться, уменьшит морщины, избавит от пятен и других дефектов кожи.",
            "Уход за кожей. Увлажняй кожу каждый раз после того, как вымоешь лицо. Если у тебя сухая кожа, используй крема на основе увлажнителей. Если кожа жирная, используй крема на основе геля.",
            "Совет. Высыпайся! Чем чаще ты высыпаешься, тем меньше стресса для организма. Стресс может быть причиной выработки гормана, который регулирует кожный жир, скапливает его и вызывает акне.",
            "Совет. Не трогай и не выдавливай прыщи. Выдавливание прыщей может повлечь распространение бактерий акне по всей коже через соседние поры. Также выдавливание вызывает воспаление и может привести к образованию рубцов.",
            "Медицина. Если тебя замучили прыщи, а все методы по борьбе с ними уже испробованы, обратись к врачу-дерматологу. Он продиагностирует состояние твоей кожи и предложит правильные методы лечения.",
            "Совет. Любое лечение требует времени. Если твоя кожа не очищается за денб. не переживай! Кожа автоматически не очистится только потому, что ты один раз умоешь ее.",
            "Медицина. Иногда возникновение прыщей - следствие гормонального нарушения. Поэтому если прыщи досаждают тебе очень сильно, проверь состояние своего гормонального фона, обратись к врачу-эндокринологу.",
            "Питание. Чрезмерное употребление жареных, жирных, острых блюд, копченостей, сладостей, хлебобулочных изделий и кафе ведет к возникновению прыщей! Сократи употребление этих продуктов до минимума.",
            "Питание. Постарайся заменить животные жиры на растительные. Съедай в день по 5 грецких орехов или миндаля. Это обеспечит твой организм витамином Е, который очень полезен для кожи.",
            "Питание. Включи в своей рацион побольше овощей, особенно темно-оранжевых и темно-зеленых: морковь, сладкий перец, картофель или шпинат . Они содержат много витамина А, который очень полезен для кожи.",
            "Уход за кожей. Умываться следует не чаще 2 раз в день. Во всех других случаях используй антибактериальные салфетки. Они не пересушивают кожу и не вызывают обострений.",
            "Уход за кожей. Не трогай лицо грязными руками! Вообще лучше лишний раз не прикасаться к лицу в течение дня.",
            "Медицина. Прыщи - индикатор проблем в организме. Пройди обследование внутренних органов. Причиной прыщей могут быть дисбактериоз, камни в почках или заболевания печени. ",
            "Совет. Избегай стрессов! При неблагоприятных психологических факторах затормаживается обновление клеток, появляется серый цвет лица, кожа морщится и сохнет. Следи за своим эмоциональным состоянием!",
            "Медицина. Жара, повышенная влажность, солнце, пыльный ветер - внешние факторы возникновения прыщей. Ультрафиолет провоцирует выработку кожного жира, ветер с пылью засоряет поры, а жара и влажность увеличивают работу сальных желез и провоцируют потоодтеление.",
            "Миф. Прыщи - от избытка шоколада. Медики провели исследования и выяснили, что никакой зависимости состояния кожи от потребления шоколада нет. Это миф.",
            "Медицина. Проверь свои миндалины. Если они нездоровы, лимфатическая система дает сбой, из организма хуже выводятся токсины. Как следствие - нарушается работа сальных желез, возникают воспаления, появляется сыпь.",
            "Питание. Не переедай на ночь! Когда ты спишь, твои ферменты работают не на расщепление пищи, а на выведение продуктов обмена. Если ты отвлечешь их от этой важной миссии, кожа будет страдать первой.",
            "Питание. Дерматологи советуют пить только органическое молоко либо заменить его кисломолочными продуктами. Это связано с тем, что в молоке могут содержаться гормоны, которые давали коровам и которые могут вызвать образлвание прыщей.",
            "Питание. Удели особое внимание продуктам с высоким содержанием клетчатки и цинка. Они нормализуют работу кишечника и регулируют работу сальных желез. Не забывай про рыбу, красное мясо, бобовые и орехи.",
            "Метод. Для борьбы с прыщами и воспалениями используй 2%, 3% или 5% салициловую мазь. Средство наносится непосредственно на пораженные участки кожи. Применять мазь нужно 2 раза в сутки. Противопоказания: почечная недостаточность, повышенная чувствительность к НПВП.",
            "Метод. Для борьбы с прыщами используй болтушку с левомицетином, который обладает антимикробным действием. Салициловая кислота снимает воспаление кожи, борная кислота и спирт подсушивают ее. Используй 2 раза в день, наноси на прыщи.",
            "Метод. При угрях, раздраженных гнойничках, расширенных порах и покраснениях лица используй настойку календулы. Настойку можно купить в аптеке.",
            "Метод. Смешай в равных количествах столовый уксус, сок лимона и воду. Протирай кожу в течение месяца и после вечерней очистки. Этот лосьон поможет тебе в борьбе с прыщами и воспалениями.",
            "Совет. Если у тебя жирная кожа, тебе не рекомендуется умываться горячей водой. Используй холодную воду, в крайнем случае воду комнатной температуры. Регулярно пользуйся отшелушивающими средствами, если, конечно, на коже нет воспалившихся прыщей.",
            "Метод. Если у тебя сухая или нормальная кожа, используй такой лосьон. Смешай 1 яичный желток с соком 1 лимона или апельсина. Добавь 1 столовую ложку водки и полстакана сливок.",
            "Совет. Ежедневно протирай лицо настоем из трав. Это желательно делать и утром, и вечером. Для этого ваткой. намоченной в настое, протри лицо несколько раз, покм кожа не станет совсем чистой. Для настоя возьми 1 столовую ложку сухой травы, залей ее стаканом кипятка и настаивай около 15 минут.",
            "Совет. Не стоит умываться водопроводной водой с мылом. Это стягивает кожу. Для смягчения воды используй обычную соду. На стакан воды положи чайную ложку питьевой соды, доведи до кипения и охлади, Для умывания разведи четверть стакана воды с содой в полутора литрах воды.",
            "Совет. Очищающее средство для кожи вокруг глаз можно заменить любым растительным маслом. Лучше всего оливковым, но подойдут и другие.",
            "Совет. Даже при появлении слабых пигментных пятен старайся избегать солнечных лучей. От них пятна сразу значительно темнеют, а также могут появиться новые.",
            "Метод. Для борьбы с пигментными пятнами подойдет следующая маска. Столовую ложку недозрелых ягод черной смородины тщательно разотри и смешай с 1 ложкой меда. Полученную массу наложи на пигментный участок кожи. Сними маску через 30 минут.",
            "Метод. Раз в неделю делай маску из одуванчиков. В одуванчиках содержатся вещества и эфирные масла, успокаивающие кожу. Горсть одуванчиков залей небольшим количеством кипяченой воды и разомни в ней цветы. Кашицу нанеси на чистое сухое лицо, а через 15 минут смой маску теплой водой."
    };
}
